### Terraform plan (sandbox)
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cloudwatch.data.aws_iam_policy_document.lambda_cloudwatch_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_cloudwatch_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowCloudWatchLogs"
        }
    }

  # module.cloudwatch.data.aws_iam_policy_document.lambda_metrics_and_notifications will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_metrics_and_notifications" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowPutMetricData"
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSnsPublish"
        }
    }

  # module.cloudwatch.aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "NaverSMSAutomationSandbox",
                                  + "SMSSentTotal",
                                ],
                              + [
                                  + ".",
                                  + "SMSFailedTotal",
                                ],
                            ]
                          + period  = 300
                          + region  = "ap-northeast-2"
                          + stat    = "Sum"
                          + title   = "SMS Delivery Volume (5-min)"
                          + yAxis   = {
                              + left = {
                                  + min = 0
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/Lambda",
                                  + "Errors",
                                  + "FunctionName",
                                  + "naver-sms-automation-sandbox",
                                ],
                              + [
                                  + "NaverSMSAutomationSandbox",
                                  + "LoginFailureTotal",
                                ],
                              + [
                                  + ".",
                                  + "SecretsErrorTotal",
                                ],
                            ]
                          + period  = 300
                          + region  = "ap-northeast-2"
                          + stat    = "Sum"
                          + title   = "Error Metrics (5-min)"
                          + yAxis   = {
                              + left = {
                                  + min = 0
                                }
                            }
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 12
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query  = <<-EOT
                                SOURCE '/aws/lambda/naver-sms-automation-sandbox'
                                | fields @timestamp, level, message, status
                                | filter ispresent(status)
                                | stats count() by status
                            EOT
                          + region = "ap-northeast-2"
                          + title  = "Log Summary by Status (Last 1h)"
                        }
                      + type       = "log"
                      + width      = 24
                      + x          = 0
                      + y          = 6
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/Lambda",
                                  + "Duration",
                                  + "FunctionName",
                                  + "naver-sms-automation-sandbox",
                                  + {
                                      + stat = "p50"
                                    },
                                ],
                              + [
       
...
(plan output truncated)
```